lochoang75/STM32_FREERTOS_BASE/main.c
/* This FreeRTOS STM32F4 based on:
https://www.instructables.com/Setting-Up-FreeRTOS-From-Scratch-on-STM32F407-Disc/ 
Remarks:
This template is upgraded to the latest FreeRTOS  202012.00 (10.4.3)

FreeRTOSConfig has been added into \FreeRTOS_STM32F4\FreeRTOSv202012.00\FreeRTOS\Source\portable\RVDS\ARM_CM4F

heap_4.c is included in the project (STM32f407VG board) to provide the memory allocation required by the RTOS kernel

System clock is based on HSE configuration

PendSV, SysTcik and SVC handlers "define" have been added to port.c
#define  xPortPendSVHandler      PendSV_Handler 
#define  xPortSysTickHandler     SysTick_Handler
#define  vPortSVCHandler         SVC_Handler
*/

/* FreeRTOS includes. */
#include <stdio.h>
#include <math.h>
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "FreeRTOS.h"
#include "task.h"
#include "stdbool.h"
#include "MY_CS43L22.h"
#include "custom_queue.h"
#include "main.h"

#define STACK_SIZE_MIN	128	/* usStackDepth	- the stack size DEFINED IN WORDS.*/
#define PI 3.14159f
//Sample rate and Output freq
#define F_SAMPLE		48000.0f // Sample freq
#define F_OUT				880.0f  // Output freq 
#define AMP				1000  // Output amplitute 
  
#define A5				880.0f  
#define B5				988.0f
#define C6				1047.0f
#define D6				1175.0f  
#define E6				1319.0f   
#define F6				1397.0f   
#define G6				1568.0f 
#define A6				1760.0f 

#define DEFAULT_DURATION 200

const float toneArr[8] = {A5,B5,C6,D6,E6,F6,G6,A6};
/* The task functions prototype*/
void vTaskBlueLED( void *pvParameters );
void vTaskOrangeLED( void *pvParameters );
void vTaskButton( void *pvParameters );
void vTaskBeep( void *pvParameters ) ;

/* Global Variables */
GPIO_InitTypeDef GPIO_InitStruct; // Initiate the structure that contains the configuration information for the specified GPIO peripheral.
TIM_HandleTypeDef TIM_InitStruct;  // Initiate the structure that contains the configuration information for the timers
TIM_HandleTypeDef TIM_InitStruct_2;

/////////
system_state_t system_state = sys_state_idle;
static volatile bool button_trigger_flag = 0;
button_action_t btn_action = button_no_action;
volatile bool timeOut=false;
select_tone_t toneList[2];
int toneId = 0;


bool initialTimer=false;

//////////

I2C_HandleTypeDef hi2c1;
I2S_HandleTypeDef hi2s3;
DMA_HandleTypeDef hdma_spi3_tx;

TaskHandle_t xBlueLEDHandler = NULL;
TaskHandle_t xButtonHandler = NULL;
TaskHandle_t xSoundHandler = NULL;
QueueHandle_t userInputEventQueue;
QueueHandle_t playerEventQueue;
//added by DUY
TaskHandle_t xButtonHandler_1 = NULL;
TaskHandle_t xButtonHandler_2 = NULL;
TaskHandle_t xButtonHandler_3 = NULL;

float mySinVal;
float sample_dt;
uint16_t sample_N;
uint16_t i_t;
uint32_t myDacVal;
buttonType button = NONE;


int16_t dataI2S[100];
bool soundOn;

void vTaskBlueLED( void *pvParameters );
void vTaskOrangeLED( void *pvParameters );
void vTaskButton( void *pvParameters );
///////////////////PREDEFINED FUNCTION////////////////////////
void turnOnRedLED(void);
void turnOnBlueLED(void);
void turnOnOrangeLED(void);
void turnOnGreenLED(void);
void turnOnAllLEDS(void);
void turnOffAllLEDS(void);
void vDetectButtonType(void*);
static void buttonIrqCallback(void);
void turnOnCurLEDS(led);
void blinkLEDS(led);
void vTaskDetectUserState(void *pvParameters);
void vTaskPlaySong(void *pvParameters);
void playTone(float tone, int time_ms);
/*
Use SysTick_Handler to wake xPortSysTickHandler when the FreeRTOS's 
scheduler is started. SysTick_Handler (HAL_IncTick) is needed by 
HAL driver such as DAC that depends on system tick but it's "conflict" 
with FreeRTOS xPortSysTickHandler because the SysTimer is used by FreeRTOS. 
*/
void counting500ms(){
		__HAL_RCC_TIM5_CLK_ENABLE(); // Enable clock to TIM2 from APB1 bus (42Mhz max)xPLL_P = 84MHz
		TIM_InitStruct_2.Instance = TIM5;
    TIM_InitStruct_2.Init.Prescaler   = 1400-1;
		TIM_InitStruct_2.Init.CounterMode = TIM_COUNTERMODE_UP;
    TIM_InitStruct_2.Init.Period = 30000-1;		
		TIM_InitStruct_2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
		TIM_InitStruct_2.Init.RepetitionCounter = 0;
		HAL_TIM_Base_Init(&TIM_InitStruct_2); // Init TIM2 
		//HAL_TIM_Base_Start_IT(&TIM_InitStruct); // Enable timer-2 IRQ interrupt
		HAL_NVIC_EnableIRQ(TIM5_IRQn); // Enable interrupt at IRQ-Level
    //HAL_TIM_Base_Start(&TIM_InitStruct); // Start TIM2
}

void SysTick_Handler(void)
{
  HAL_IncTick();
	
	if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {
			xPortSysTickHandler();
  }
	
}

/** ISR Function **/
void EXTI0_IRQHandler(void) 
{
	// Reset existing interrupt at GPIO_PIN_0
	__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_0); //alternative: HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0)
	// Resume the button task from the ISR
	//BaseType_t xYieldRequiredCheck = xTaskResumeFromISR(xButtonHandler);
	//portYIELD_FROM_ISR(xYieldRequiredCheck); // Yield to avoid delayed until the next time the scheduler
	buttonIrqCallback();
	return;
}

/** This function handles DMA1 stream5 global interrupt. **/
void DMA1_Stream5_IRQHandler(void)
{
  HAL_DMA_IRQHandler(&hdma_spi3_tx);
}

void SystemClock_Config(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
	
  // Enable Power Control clock
  __PWR_CLK_ENABLE();

  // The voltage scaling allows optimizing the power consumption when the
  // device is clocked below the maximum system frequency, to update the
  // voltage scaling value regarding system frequency refer to product
  // datasheet.
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  // Enable HSE Oscillator and activate PLL with HSE as source
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;

  // Based on the STM32F407 HSE clock configuration
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
  // clocks dividers
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK| RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
	
	// Select peripheral clock for I2S
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_I2S;
  PeriphClkInitStruct.PLLI2S.PLLI2SN = 100;
  PeriphClkInitStruct.PLLI2S.PLLI2SR = 2;
  HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
}

void InitLED(void)
{
    __HAL_RCC_GPIOD_CLK_ENABLE();  // Enable clock to GPIO-D for LEDs
    // Set GPIOD Pins Parameters 
    GPIO_InitStruct.Pin     = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;  // I/O PD12, PD13, PD14, and PD15
    GPIO_InitStruct.Mode    = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull    = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed   = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);    // Init GPIOD 
}

