lochoang75/STM32_FREERTOS_BASE/main.c
void InitGPIO(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  //__HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level LEDs and DAC output */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15|GPIO_PIN_4, GPIO_PIN_RESET);

  /*Configure GPIO pins : PD12 PD13 PD14 PD15 PD4 */
  GPIO_InitStruct.Pin = GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15 |GPIO_PIN_4;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
}

void InitButton(void)
{
	  __HAL_RCC_GPIOA_CLK_ENABLE();  // Enable clock to GPIO-A for button
    // Set GPIOA Pin Parameters, pin 0 for button
    GPIO_InitStruct.Pin     = GPIO_PIN_0;
	  // Specifies the trigger signal active edge for the EXTI lines. (e.g. Rising = button is pressed)
    GPIO_InitStruct.Mode    = GPIO_MODE_IT_RISING; //ori GPIO_MODE_IT_FALLING
    GPIO_InitStruct.Pull    = GPIO_PULLDOWN; //ori GPIO_NOPULL
    GPIO_InitStruct.Speed   = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);  // Init GPIOA
		HAL_NVIC_SetPriority(EXTI0_IRQn, 10, 0);
		HAL_NVIC_EnableIRQ(EXTI0_IRQn); // Enable GPIO_PIN_0 interrupt at IRQ-Level
}	

/* I2C1 init function */
void InitI2C1(void)
{
		hi2c1.Instance = I2C1;
		hi2c1.Init.ClockSpeed = 100000; // clock frequency <= 400kHz
		hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2; //fast mode Tlow/Thigh = 2
		hi2c1.Init.OwnAddress1 = 0; 
		hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
		hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
		hi2c1.Init.OwnAddress2 = 0; 
		hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
		hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
		HAL_I2C_Init(&hi2c1); //initialize the I2C peripheral 
}

/* I2S3 init function */
void InitI2S3(void)
{
		hi2s3.Instance = SPI3;
		hi2s3.Init.Mode = I2S_MODE_MASTER_TX; //transmit in master mode
		hi2s3.Init.Standard = I2S_STANDARD_PHILIPS; //data protocol
		hi2s3.Init.DataFormat = I2S_DATAFORMAT_16B; //bits per sample
		hi2s3.Init.MCLKOutput = I2S_MCLKOUTPUT_ENABLE; //master clock signal
		hi2s3.Init.AudioFreq = I2S_AUDIOFREQ_48K; //audio frequency
		hi2s3.Init.CPOL = I2S_CPOL_LOW; //clock polarity
		hi2s3.Init.ClockSource = I2S_CLOCK_PLL;
		hi2s3.Init.FullDuplexMode = I2S_FULLDUPLEXMODE_DISABLE;
		HAL_I2S_Init(&hi2s3); //set the setting 
}

/** 
  * Enable DMA controller clock
  */
void InitDMA(void) 
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);
}
/*-----------------------------------------------------------*/

int main( void )
{

	/* essential Board initializations */
	SystemInit();
	HAL_Init();
	/* This function initializes the MCU clock, PLL will be used to generate Main MCU clock */
  SystemClock_Config();
	/* Initialize the serial I/O(console ), This function configures Due's CONSOLE_UART */
	
	InitGPIO();
	//InitLED();
	InitButton();
	InitDMA();
	InitI2C1();
	InitI2S3();
	soundOn = true;

	counting500ms();//inititate the 500ms timer
	// user input event queue
	userInputEventQueue = xQueueCreate(2, sizeof(button_action_t));
	playerEventQueue = xQueueCreate(2, sizeof(player_event_t));
	

	/* Create one of the two tasks. */
	
	//xTaskCreate(	vTaskBlueLED,		/* Pointer to the function that implements the task. */
	//				"vTaskBlueLED",	/* Text name for the task.  This is to facilitate debugging only. */
	//				STACK_SIZE_MIN,		/* Stack depth in words. */
	//				NULL,		/* We are not using the task parameter. */
	//				tskIDLE_PRIORITY,			/* This task will run at priority 1. */
	//				&xBlueLEDHandler );		/* We are not using the task handle. */

	//xTaskCreate( vTaskOrangeLED, "vTaskBlueLED", STACK_SIZE_MIN, NULL, tskIDLE_PRIORITY, NULL );

	//xTaskCreate( vTaskButton, "vTaskButton", STACK_SIZE_MIN*2, NULL, tskIDLE_PRIORITY, &xButtonHandler );
	xTaskCreate(vDetectButtonType, "vDetectButtonType",STACK_SIZE_MIN,NULL,3,&xButtonHandler_1);
	xTaskCreate(vTaskDetectUserState, "vDetectUserState",STACK_SIZE_MIN,NULL,3,&xButtonHandler_2);
	xTaskCreate(vTaskPlaySong, "vTaskPlaySong",STACK_SIZE_MIN,NULL,3,&xButtonHandler_3);
	/* Start the scheduler so our tasks start executing. */
	vTaskStartScheduler();

	/* If all is well we will never reach here as the scheduler will now be
	running.  If we do reach here then it is likely that there was insufficient
	heap available for the idle task to be created. */
	for( ;; );
}
/*-----------------------------------------------------------*/
static void buttonIrqCallback() {
    button_trigger_flag = 1;
		//HAL_Delay(10);
}
static inline bool readGPIOPIn() {
	if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
		return 1; //TODO change this to return value of GPIO
	}
	return 0;
}
static inline void buttonFlagReset() {
    // disable irq first
    button_trigger_flag = 0;
    // enble irq
}
void TIM5_IRQHandler(void){
	HAL_TIM_IRQHandler(&TIM_InitStruct_2);
	if(__HAL_TIM_GET_FLAG(&TIM_InitStruct_2, TIM_FLAG_CC1) != RESET){
		timeOut=true;
	}
	__HAL_TIM_CLEAR_FLAG(&TIM_InitStruct_2, TIM_SR_UIF);
	return;
}
void startTimer500ms(){
	HAL_TIM_Base_Start_IT(&TIM_InitStruct_2);
	HAL_TIM_Base_Start(&TIM_InitStruct_2);
}
void stopTimer500ms(){
	HAL_TIM_Base_Stop_IT(&TIM_InitStruct_2);
	HAL_TIM_Base_Stop(&TIM_InitStruct_2);
}

void vDetectButtonType(void *pvParameters){
	while(1){
		vTaskDelay(10);
		switch (system_state) {
            case sys_state_idle:{
                if (button_trigger_flag == 1) {
                    system_state = sys_state_wait_first_pressed_done;
                    //timeout_cnt = LONG_PRESSED_TIMEOUT;
                    btn_action = button_single_pressed;
										//printf("first press is done \n");
                } else {
                    /* Idle state delay for 10ms */
                    //delayms(10);
										//printf("waiting for first press\n");	
										vTaskDelay(10); // Use vtaskDelay
                }
                break;
							}
            case sys_state_wait_first_pressed_done:
								//printf("WE ARE IN WAIT FIRST PRESS DONE, WE ARE IN WAIT FIRST PRESS DONE\n");
                if (HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)==0) {
										//printf("0\n");
										buttonFlagReset();
										system_state = sys_state_wait_timeout;										
								} 
								//else
									//printf("1\n");
                break;
            case sys_state_wait_timeout:
								//printf("WE ARE IN WAITING TIME OUT, WE ARE IN WAITING TIME OUT,WE ARE IN WAITING TIME OUT\n");
                if (button_trigger_flag == 0) {
										if(initialTimer==false){
											initialTimer=true;
											//counting500ms();
											startTimer500ms();
										}
										if(timeOut==true){
											//end of the waiting, shut down the timer, SINGLE PRESS
											//stop timer
											stopTimer500ms();
											//reset variables
											initialTimer=false;
											//reset timeout Status
											timeOut=false;
											btn_action = button_single_pressed;
                      system_state = sys_state_idle;
											//printf("single press is done,single press is done,single press is done,single press is done\n");
											
											
											
											//PUSH BUTTON ACTION TO QUEUE
											xQueueSend(userInputEventQueue, &btn_action, portMAX_DELAY);
											break;
										}
                } else {
                    // found trigger
                    btn_action = button_double_pressed;
                    system_state = sys_state_idle;
										//stop timer
										//HAL_TIM_Base_Stop(&TIM_InitStruct);
										//HAL_TIM_Base_Stop_IT(&TIM_InitStruct);
										stopTimer500ms();
										//reset variables
										initialTimer=false;
										//reset timeOut status
										timeOut=false;
										//printf("double press is done,double press is done,double press is done\n");
										//PUSH BUTTON ACTION TO QUEUE
										xQueueSend(userInputEventQueue, &btn_action, portMAX_DELAY);

                    break;
                }
                break;
						//ADDED ON 17/2/////////////////////////////////////////////////////		
						/*case sys_state_wait_multiple_press:{
							//HAL_Delay(10);
							//for(;;){
								//since there is a button press, we must initialize the timer 5s. Because maybe the user won't press anymore
								if(button_trigger_flag==1){
									if(initialTimer==false){
										startTimer5s();
										initialTimer=true;
									}
								}
								if(timeOut==true){
									stopTimer5s();
									initialTimer=false;
									timeOut=false;
									btn_action = button_multiple_pressed;
									system_state = sys_state_on_working;
									break;
								}
								
							//}
						}*/
		}
	}
}
//TASK 2, for detecting user state
led curLedId = none;
int tonePosition = 0;
void vTaskDetectUserState(void *pvParameters){
	button_action_t button = button_no_action;
	user_action_t userState = user_select_tone;
	select_tone_t tone = {.tone=0,.duration=0};
	player_event_t player_event = player_stop;
	while(1){
		//pop event from message queue
		xQueueReceive(userInputEventQueue, &button, portMAX_DELAY);
		switch(userState){
			case user_select_tone:
				switch(button){
					//single press for iterating tones
					case button_single_pressed:
						//iterating tones, show led according to tones
						curLedId++;
						turnOnCurLEDS(curLedId);
						playTone(toneArr[tonePosition],DEFAULT_DURATION);
						if(curLedId==green){
							curLedId=none;
						}
						//REMEMBER TO RESET TONE POS WHEN IT IS = 8
						tonePosition++;
						if(tonePosition==8){
							tonePosition=0;
						}
						break;
					case button_double_pressed:
						
