lochoang75/STM32_FREERTOS_BASE/main.c
						//only set tone ID, 
						turnOffAllLEDS();
						blinkLEDS(curLedId);
						toneList[toneId].tone=curLedId;
						userState = user_select_duration;
						curLedId=none;
						break;
					default:
						break;
				}
				break;
			//case user_confirm_tone:
			//	break;
			case user_select_duration:
				switch(button){
					//single press for iterating tones
					case button_single_pressed:
						//iterating durations, show led according to tones
						curLedId++;	
						turnOnCurLEDS(curLedId);
						
						if(curLedId==green){
							curLedId=none;
						}
						break;
					case button_double_pressed:
						//only set tone duration,
						turnOffAllLEDS();					
						blinkLEDS(curLedId);
						//use list[i].duration
						tone.duration=10;
						userState = user_select_tone;
						//PUSH TONE TO TONE QUEUE.
						//toneList[toneId].tone=curLedId;
						curLedId=none;
						toneId++;
						if(toneId==2){
							player_event = player_start;
							xQueueSend(playerEventQueue, &player_event, portMAX_DELAY);
						}
						break;
					default:
						break;
				}
				break;
			//case user_confirm_duration:
			//	break;
			default:
				break;
		}
		//check if the queue size = 8. If so, start the task 3 (Playing music)	
		//PUSH EVENT PLAYING MUSIC TO QUEUE
	}
}
//TASK 3, playing song
void vTaskPlaySong(void *pvParameters){
	player_event_t player_event = player_stop;
	while(1){
		xQueueReceive(playerEventQueue, &player_event,portMAX_DELAY);
		if(player_event==player_start){
			for(int i=0;i<toneId;i++){
				blinkLEDS(toneList[i].tone);
				//vTaskDelay(200);
			}
			toneId=0;
		}
	}
}

void playTone(float tone, int time_ms){
			//HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_SET);
			//HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_SET);
	
			//printf("tone %d \n",tone);
			CS43_Init(hi2c1, MODE_I2S);
			CS43_SetVolume(30); //0 - 100
			CS43_Enable_RightLeft(CS43_RIGHT_LEFT);
			CS43_Start();
			//Create Sine wave
			sample_dt = tone/F_SAMPLE;
			sample_N =  F_SAMPLE/tone;
			for(uint16_t i=0; i<sample_N; i++)
			{
				mySinVal = AMP*sinf(i*2*PI*sample_dt); 
				dataI2S[i*2] = mySinVal;    //Right data (even: 0,2,4,6...)
				dataI2S[i*2 + 1] = mySinVal; //Left data  (odd: 1,3,5,7...)
			}
		
			// Output the sample through I2S from DMA
			HAL_I2S_Transmit_DMA(&hi2s3, (uint16_t *)dataI2S, sample_N*2);
			vTaskDelay(time_ms);
			// Reset the DAC output pin 
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4,GPIO_PIN_RESET);
}




void vTaskBlueLED( void *pvParameters ) // Blue LED
{
const char *pcTaskName = "vTaskBlueLED is running\n";
volatile unsigned long ul;

	/* As per most tasks, this task is implemented in an infinite loop. */
	for( ;; )
	{
		/* Print out the name of this task in debug */
    printf("%s\n",pcTaskName);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
		vTaskDelay(500);
		
	}
} 

void vTaskOrangeLED( void *pvParameters ) // Orange LED
{
	const char *pcTaskName = "vTaskOrangeLED is running\n";
	volatile unsigned long ul;

	/* As per most tasks, this task is implemented in an infinite loop. */
	for( ;; )
	{
		/* Print out the name of this task in debug */
		printf("%s\n",pcTaskName);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
		vTaskDelay(1000);
	}
}

void vTaskButton( void *pvParameters ) // Button Task (interrupt)
{
	const char *pcTaskName = "vTaskButton is running\n";
	
	for(;;)
	{
		vTaskSuspend(NULL); //Suspend itself until resume from ISR
		/* Print out the name of this task in debug */
		printf("%s\n",pcTaskName);
		vTaskResume(xSoundHandler);
		vTaskDelay(200); //Debounce using FreeRTOS software timer
	}
}

void vTaskBeep( void *pvParameters ) 
{
	const char *pcTaskName = "vTaskBeep is running\n";

	for(;;)
	{
		//vTaskSuspend(NULL); //Suspend itself until resume 
		printf("%s\n",pcTaskName);
		if (soundOn){	
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_RESET);
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_SET);

			CS43_Init(hi2c1, MODE_I2S);
			CS43_SetVolume(30); //0 - 100
			CS43_Enable_RightLeft(CS43_RIGHT_LEFT);
			CS43_Start();
			//Create Sine wave
			sample_dt = A5/F_SAMPLE;
			sample_N =  F_SAMPLE/A5;
			for(uint16_t i=0; i<sample_N; i++)
			{
				mySinVal = AMP*sinf(i*2*PI*sample_dt); 
				dataI2S[i*2] = mySinVal;    //Right data (even: 0,2,4,6...)
				dataI2S[i*2 + 1] = mySinVal; //Left data  (odd: 1,3,5,7...)
			}
		
			// Output the sample through I2S from DMA
			HAL_I2S_Transmit_DMA(&hi2s3, (uint16_t *)dataI2S, sample_N*2);
			vTaskDelay(500);
			// Reset the DAC output pin 
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4,GPIO_PIN_RESET);
			//CS43_Stop();
			soundOn = false;
		}
		else{
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_SET);
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_RESET);
			
			CS43_Init(hi2c1, MODE_I2S);
			CS43_SetVolume(1); //0 - 100
			CS43_Enable_RightLeft(CS43_RIGHT_LEFT);
			CS43_Start();
			//Create Sine wave
			sample_dt = A6/F_SAMPLE;
			sample_N =  F_SAMPLE/A6;
			for(uint16_t i=0; i<sample_N; i++)
			{
				mySinVal = AMP*sinf(i*2*PI*sample_dt); 
				dataI2S[i*2] = mySinVal;    //Right data (even: 0,2,4,6...)
				dataI2S[i*2 + 1] = mySinVal; //Left data  (odd: 1,3,5,7...)
			}
		
			// Output the sample through I2S from DMA
			HAL_I2S_Transmit_DMA(&hi2s3, (uint16_t *)dataI2S, sample_N*2);
			vTaskDelay(500);
			// Reset the DAC output pin 
			HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4,GPIO_PIN_RESET);
			
			soundOn = true;
		}
		vTaskSuspend(NULL); 
	}
}
/*-----------------------------------------------------------*/

void vApplicationMallocFailedHook( void )
{
	/* This function will only be called if an API call to create a task, queue
	or semaphore fails because there is too little heap RAM remaining. */
	for( ;; );
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( xTaskHandle *pxTask, signed char *pcTaskName )
{
	/* This function will only be called if a task overflows its stack.  Note
	that stack overflow checking does slow down the context switch
	implementation. */
	for( ;; );
}
/*-----------------------------------------------------------*/

